College Notes/DSA.org
#+title: Advanced Data Structures And Algorithm Analysis
#+author: Adithya Nair
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>


* DSA Notes
** Graphs
*** Representations Of A Graph
**** Adjacency Matrix
Adjacency matrices are matrices which can be used to represent the connections that nodes have to each other. This is done by making a matrix of size $n$ for $n$ nodes. And the following rules exist for generating the matrix.

1. if there is a link from node $i$ to node $j$ then the element $a_{ij}$ for the adjacency matrix $a$ is 1.
2. if there is no link, then the element is zero.

\begin{bmatrix}
a_{11} & a_{12} & \cdots & a_{1n} \\
a_{21} & a_{22} & \cdots & a_{2n} \\
\vdots & &\ddots & \vdots \\
a_{n1} & a_{n2} & \cdots & a_{nn} \\
\end{bmatrix}

as a consequence of this, undirected graphs(graphs where the links represent connection rather than direction) are represented with a symmetric matrix.
**** Adjacency Lists
adjacency lists are an alternative representation of graphs. if a graph has $n$ nodes, then the list has $n$ elements. the list adjlist is then made with the following rules.

*adjlist[i] contains all the nodes which are connected to vertex $i$, in the order in which they are connected.*

for an example graph,

\begin{align*}
&a \rightarrow b \rightarrow c \rightarrow d  \\
&\downarrow \\
&b \rightarrow a \rightarrow c \\
&\downarrow \\
&c \rightarrow a \rightarrow b \\
&\downarrow \\
&d \rightarrow a \rightarrow e\\
&\downarrow \\
&e \rightarrow d \\
\end{align*}

we have a linked list of linked lists. the problem here is that links are represented twice.

this is an optimization for when graphs have very few links.

*** Traversal(visit all nodes).
there are two algorithms of traversal:
1. breadth-first search - which involves the usage of queue
2. depth-first search - which involves the usage of stack

**** Breadth-First Search
breadth-first involves selecting a root node, and choosing a neighbour node.

revising queues, they have a first-in, first out approach, insertion at the rear and deletion at the front.
the procedure follows:
- the queue starts by inserting any root node, say for example a.
- now a is dequeued and stored in the result.
- queue all neighbouring nodes of a.
- the first node is dequeued.
- upon dequeueing, all neighbouring nodes are checked if it's in the queue. if not, they are queued in.
	- let's say b is taken, and b is connected to c, and c is already connected to a and b.
	- a and c will not be queued. - this iterates until there are no more nodes.

clearly, this depends on the number of edges in the graph. the maximum number of edges in a graph is $^nc_2$.

the functions required in this queue are:
- `insert()`
- `delete()`
- `traverse()`

