College Notes/DSA.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-30 Mon 08:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advanced Data Structures And Algorithm Analysis</title>
<meta name="author" content="Adithya Nair" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Advanced Data Structures And Algorithm Analysis</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9525ea9">1. DSA Notes</a>
<ul>
<li><a href="#org7748699">1.1. Graphs</a>
<ul>
<li><a href="#org33ad42d">1.1.1. Representations Of A Graph</a></li>
<li><a href="#org6c1b14c">1.1.2. Traversal(visit all nodes).</a></li>
</ul>
</li>
<li><a href="#orga2e7c50">1.2. Trees</a>
<ul>
<li><a href="#orgec0fdb4">1.2.1. Properties</a></li>
<li><a href="#orgeaa2291">1.2.2. Types Of Binary Trees</a></li>
<li><a href="#orge425575">1.2.3. binary search tree</a></li>
<li><a href="#org8c1b01b">1.2.4. Avl Trees(Height Balanced Binary Tree)</a></li>
</ul>
</li>
<li><a href="#orgcca8727">1.3. Heap</a>
<ul>
<li><a href="#org9ba886e">1.3.1. Types Of Heap</a></li>
<li><a href="#orgb89f4af">1.3.2. Definition</a></li>
<li><a href="#org4bff801">1.3.3. Insertion</a></li>
<li><a href="#orga8825ad">1.3.4. Deletion</a></li>
</ul>
</li>
<li><a href="#org4d89df7">1.4. Tries</a>
<ul>
<li><a href="#orge1848b2">1.4.1. Properties Of Trie</a></li>
<li><a href="#orgf79536e">1.4.2. Applications</a></li>
</ul>
</li>
<li><a href="#org70eaee6">1.5. Hashing</a>
<ul>
<li><a href="#org0428036">1.5.1. Hash Table</a></li>
<li><a href="#orgd0d4f58">1.5.2. Hash Functions</a></li>
<li><a href="#orgd4dbf23">1.5.3. Collision Avoidance Methods</a></li>
</ul>
</li>
<li><a href="#org94c67a0">1.6. Merkel Trees</a>
<ul>
<li><a href="#org5f1e0df">1.6.1. Usage</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9525ea9" class="outline-2">
<h2 id="org9525ea9"><span class="section-number-2">1.</span> DSA Notes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7748699" class="outline-3">
<h3 id="org7748699"><span class="section-number-3">1.1.</span> Graphs</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org33ad42d" class="outline-4">
<h4 id="org33ad42d"><span class="section-number-4">1.1.1.</span> Representations Of A Graph</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgbd40058"></a>Adjacency Matrix<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
Adjacency matrices are matrices which can be used to represent the connections that nodes have to each other. This is done by making a matrix of size \(n\) for \(n\) nodes. And the following rules exist for generating the matrix.
</p>

<ol class="org-ol">
<li>if there is a link from node \(i\) to node \(j\) then the element \(a_{ij}\) for the adjacency matrix \(a\) is 1.</li>
<li>if there is no link, then the element is zero.</li>
</ol>

\begin{bmatrix}
a_{11} & a_{12} & \cdots & a_{1n} \\
a_{21} & a_{22} & \cdots & a_{2n} \\
\vdots & &\ddots & \vdots \\
a_{n1} & a_{n2} & \cdots & a_{nn} \\
\end{bmatrix}

<p>
as a consequence of this, undirected graphs(graphs where the links represent connection rather than direction) are represented with a symmetric matrix.
</p>
</div>
</li>
<li><a id="orgd69f378"></a>Adjacency Lists<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
adjacency lists are an alternative representation of graphs. if a graph has \(n\) nodes, then the list has \(n\) elements. the list adjlist is then made with the following rules.
</p>

<p>
<b>adjlist[i] contains all the nodes which are connected to vertex \(i\), in the order in which they are connected.</b>
</p>

<p>
for an example graph,
</p>

\begin{align*}
&a \rightarrow b \rightarrow c \rightarrow d  \\
&\downarrow \\
&b \rightarrow a \rightarrow c \\
&\downarrow \\
&c \rightarrow a \rightarrow b \\
&\downarrow \\
&d \rightarrow a \rightarrow e\\
&\downarrow \\
&e \rightarrow d \\
\end{align*}

<p>
we have a linked list of linked lists. the problem here is that links are represented twice.
</p>

<p>
this is an optimization for when graphs have very few links.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org6c1b14c" class="outline-4">
<h4 id="org6c1b14c"><span class="section-number-4">1.1.2.</span> Traversal(visit all nodes).</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
there are two algorithms of traversal:
</p>
<ol class="org-ol">
<li>breadth-first search - which involves the usage of queue</li>
<li>depth-first search - which involves the usage of stack</li>
</ol>
</div>
<ol class="org-ol">
<li><a id="orgaa5520e"></a>Breadth-First Search<br />
<div class="outline-text-5" id="text-1-1-2-1">
<p>
breadth-first involves selecting a root node, and choosing a neighbour node.
</p>

<p>
revising queues, they have a first-in, first out approach, insertion at the rear and deletion at the front.
the procedure follows:
</p>
<ul class="org-ul">
<li>the queue starts by inserting any root node, say for example a.</li>
<li>now a is dequeued and stored in the result.</li>
<li>queue all neighbouring nodes of a.</li>
<li>the first node is dequeued.</li>
<li>upon dequeueing, all neighbouring nodes are checked if it&rsquo;s in the queue. if not, they are queued in.
<ul class="org-ul">
<li>let&rsquo;s say b is taken, and b is connected to c, and c is already connected to a and b.</li>
<li>a and c will not be queued. - this iterates until there are no more nodes.</li>
</ul></li>
</ul>

<p>
clearly, this depends on the number of edges in the graph. the maximum number of edges in a graph is \(^nc_2\).
</p>

<p>
the functions required in this queue are:
</p>
<ul class="org-ul">
<li>`insert()`</li>
<li>`delete()`</li>
<li>`traverse()`</li>
</ul>
</div>
</li>
