Archive/sem-3/College Notes/DSA.tex
% Created 2024-09-20 Fri 09:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Adithya Nair}
\date{\today}
\title{Advanced Data Structures And Algorithm Analysis}
\hypersetup{
 pdfauthor={Adithya Nair},
 pdftitle={Advanced Data Structures And Algorithm Analysis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{DSA Notes}
\label{sec:orgc472923}
\subsection{Graphs}
\label{sec:orge817b3d}
\subsubsection{Representations Of A Graph}
\label{sec:org50452ed}
\begin{enumerate}
\item Adjacency Matrix
\label{sec:org433a36c}
Adjacency matrices are matrices which can be used to represent the connections that nodes have to each other. This is done by making a matrix of size \(n\) for \(n\) nodes. And the following rules exist for generating the matrix.

\begin{enumerate}
\item If there is a link from node \(i\) to node \(j\) then the element \(A_{ij}\) for the adjacency matrix \(A\) is 1.
\item If there is no link, then the element is zero.
\end{enumerate}

\begin{bmatrix}
a_{11} & a_{12} & \cdots & a_{1n} \\
a_{21} & a_{22} & \cdots & a_{2n} \\
\vdots & &\ddots & \vdots \\
a_{n1} & a_{n2} & \cdots & a_{nn} \\
\end{bmatrix}

As a consequence of this, undirected graphs(graphs where the links represent connection rather than direction) are represented with a symmetric matrix.
\item Adjacency Lists
\label{sec:orgf01ca2f}
Adjacency lists are an alternative representation of graphs. If a graph has \(n\) nodes, then the list has \(n\) elements. The list adjList is then made with the following rules.

\textbf{adjlist[i] contains all the nodes which are connected to vertex \(i\), in the order in which they are connected.}

for an example graph,

\begin{align*}
&a \rightarrow b \rightarrow c \rightarrow d  \\
&\downarrow \\
&b \rightarrow a \rightarrow c \\
&\downarrow \\
&c \rightarrow a \rightarrow b \\
&\downarrow \\
&d \rightarrow a \rightarrow e\\
&\downarrow \\
&e \rightarrow d \\
\end{align*}

we have a linked list of linked lists. the problem here is that links are represented twice.

this is an optimization for when graphs have very few links.
\end{enumerate}
\subsubsection{traversal(visit all nodes).}
\label{sec:org0839c4a}
there are two algorithms of traversal:
\begin{enumerate}
\item breadth-first search - which involves the usage of queue
\item depth-first search - which involves the usage of stack
\end{enumerate}
\begin{enumerate}
\item breadth-first search
\label{sec:org8983821}
breadth-first involves selecting a root node, and choosing a neighbour node.

revising queues, they have a first-in, first out approach, insertion at the rear and deletion at the front.
the procedure follows:
\begin{itemize}
\item the queue starts by inserting any root node, say for example a.
\item now a is dequeued and stored in the result.
\item queue all neighbouring nodes of a.
\item the first node is dequeued.
\item upon dequeueing, all neighbouring nodes are checked if it's in the queue. if not, they are queued in.
\begin{itemize}
\item let's say b is taken, and b is connected to c, and c is already connected to a and b.
\item a and c will not be queued.
\end{itemize}
\item this iterates until there are no more nodes.
\end{itemize}

clearly, this depends on the number of edges in the graph. the maximum number of edges in a graph is \(^nc_2\).

the functions required in this queue are:
\begin{itemize}
\item `insert()`
\item `delete()`
\item `traverse()`
\end{itemize}
\item depth-first search
\label{sec:orgfcb65df}
