College Notes/DSA.org
**** Depth-First Search
this involves traversing the nodes until an edge node is met, using a stack.

the procedure follows:
- a node is selected and pushed into the stack.
- a random node connected to a is pushed.
- a connected node is pushed.
- this procedure is met until no unvisited node exists
  - in which case the stack is full.
  - if the stack is still not full, it implies that there are nodes which haven't been visited.
- now popping occurs
- the algorithm goes back and checks for unvisited nodes by popping the stack and checking the topmost element's adjacent nodes for unvisited nodes.
- this is done until the stack is empty

#+begin_src java
class dfs {
  dfs(int v)  {
    adj = new linkedlist[v];
    visited = new boolean[v];
    for (int i = 0; i < v; i++)
      adj[i] = new linkedlist<integer>();
  }
}
#+end_src

** Trees

a tree with at most two links from one node is known as a binary tree.
*** Properties
- maximum number of nodes - $2^i$
- height is longest distance between root to leaf nodes (count the edges)
- maximum number of nodes possible till height h is $(2^0 + 2^1 + 2^2 + \cdots 2^h)$ = $2^{h+1} -1$
*** Types Of Binary Trees
**** Full/Proper/Strict Binary Tree
it is a tree where each node must contain 2 children except the leaf node.

- there are either two children or no children.
- the number of leaf nodes is equal to number of internal nodes + 1
- the minimum number of nodes is equal to $2^h + 1$
- maximum number of nodes is the same as number of nodes in binary tree, $2^{h+1} - 1$
- the minimum height of the full binary tree is $log_2(n+1) - 1$
**** Complete Binary Tree
A Binary Tree where all the nodes are completely filled except the last level.
**** todo degenerate binary tree
exactly like a linked list.
**** balanced binary tree
- the heights of left and right trees can have a maximum height difference of 1.
*** binary search tree
value of left node must be smaller than parent, and value of right node must be greater than the parent node.
**** binary search tree insertion
**** binary search tree deletion
- it works the same as a linked list operation.
- we use in order traversal to figure out the node's value, it takes the value of its in order successor.
*** Avl Trees(Height Balanced Binary Tree)
what this solves is the fact that we have a series of insertions that are 'skinny'. an avl tree is balanced, the height is as minimal as possible.

each node is given a balancing factor, $= h_l-h_r$
a tree is said to be imbalanced if any node is said to have a balancing factor $\geq$ 2.
there are 4 insertions that can be performed, also known as 'rotations':
- ll - /, ll rotation, involve shifting a node to the right, the central node in the line becomes a root node.
- rr - \, rr rotation, involves shifting a node to the left, the central node in the line becomes a root node.
- lr - <, lr rotation, the last node in the subtree becomes the root node(it forms an rr + ll rotation)
- rl - >, rl rotation, the last node in the subtree becomes the root node(perform an ll + rr rotation)

the first letter is the sub-tree, and the second letter is the child node.

construct an avl tree by inserting 14,17,11,7,53,4,13,12,8,16,19,60,20

all 4 rotations are capable of causing an imbalance.
#+begin_src

#+end_src
** Heap
heap is a data structure with a complete binary tree. this tree is mainly used for creating an efficient sorting algorithm.
*** Types Of Heap
there are two types of heap:
**** Min Heap
the value of the root node is less than or equal to its children
**** Max Heap
the value of the root node is more than or equal to its children
