College Notes/DSA.html
<li><a id="orgf5c64ba"></a>Depth-First Search<br />
<div class="outline-text-5" id="text-1-1-2-2">
<p>
this involves traversing the nodes until an edge node is met, using a stack.
</p>

<p>
the procedure follows:
</p>
<ul class="org-ul">
<li>a node is selected and pushed into the stack.</li>
<li>a random node connected to a is pushed.</li>
<li>a connected node is pushed.</li>
<li>this procedure is met until no unvisited node exists
<ul class="org-ul">
<li>in which case the stack is full.</li>
<li>if the stack is still not full, it implies that there are nodes which haven&rsquo;t been visited.</li>
</ul></li>
<li>now popping occurs</li>
<li>the algorithm goes back and checks for unvisited nodes by popping the stack and checking the topmost element&rsquo;s adjacent nodes for unvisited nodes.</li>
<li>this is done until the stack is empty</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #cba6f7;">class</span> <span style="color: #f9e2af;">dfs</span> <span style="color: #f38ba8;">{</span>
&#9474; dfs<span style="color: #fab387;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">v</span><span style="color: #fab387;">)</span>  <span style="color: #fab387;">{</span>
&#9474;   adj = <span style="color: #cba6f7;">new</span> <span style="color: #f9e2af;">linkedlist</span><span style="color: #f9e2af;">[</span>v<span style="color: #f9e2af;">]</span>;
&#9474;   visited = <span style="color: #cba6f7;">new</span> <span style="color: #f9e2af;">boolean</span><span style="color: #f9e2af;">[</span>v<span style="color: #f9e2af;">]</span>;
&#9474;   <span style="color: #cba6f7;">for</span> <span style="color: #f9e2af;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">i</span> = <span style="color: #fab387;">0</span>; i &lt; <span style="color: #f9e2af;">v</span>; i++<span style="color: #f9e2af;">)</span>
&#9474;   &#9474; adj<span style="color: #f9e2af;">[</span>i<span style="color: #f9e2af;">]</span> = <span style="color: #cba6f7;">new</span> <span style="color: #f9e2af;">linkedlist</span><span style="color: #f9e2af;">&lt;</span><span style="color: #f9e2af;">integer</span><span style="color: #f9e2af;">&gt;()</span>;
&#9474; <span style="color: #fab387;">}</span>
<span style="color: #f38ba8;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orga2e7c50" class="outline-3">
<h3 id="orga2e7c50"><span class="section-number-3">1.2.</span> Trees</h3>
<div class="outline-text-3" id="text-1-2">
<p>
a tree with at most two links from one node is known as a binary tree.
</p>
</div>
<div id="outline-container-orgec0fdb4" class="outline-4">
<h4 id="orgec0fdb4"><span class="section-number-4">1.2.1.</span> Properties</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>maximum number of nodes - \(2^i\)</li>
<li>height is longest distance between root to leaf nodes (count the edges)</li>
<li>maximum number of nodes possible till height h is \((2^0 + 2^1 + 2^2 + \cdots 2^h)\) = \(2^{h+1} -1\)</li>
</ul>
</div>
</div>
<div id="outline-container-orgeaa2291" class="outline-4">
<h4 id="orgeaa2291"><span class="section-number-4">1.2.2.</span> Types Of Binary Trees</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org33c5916"></a>Full/Proper/Strict Binary Tree<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
it is a tree where each node must contain 2 children except the leaf node.
</p>

<ul class="org-ul">
<li>there are either two children or no children.</li>
<li>the number of leaf nodes is equal to number of internal nodes + 1</li>
<li>the minimum number of nodes is equal to \(2^h + 1\)</li>
<li>maximum number of nodes is the same as number of nodes in binary tree, \(2^{h+1} - 1\)</li>
<li>the minimum height of the full binary tree is \(log_2(n+1) - 1\)</li>
</ul>
</div>
</li>
<li><a id="orgae514d9"></a>Complete Binary Tree<br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
A Binary Tree where all the nodes are completely filled except the last level.
</p>
</div>
</li>
<li><a id="org1f4872b"></a>todo degenerate binary tree<br />
<div class="outline-text-5" id="text-1-2-2-3">
<p>
exactly like a linked list.
</p>
</div>
</li>
<li><a id="org7ebd78e"></a>balanced binary tree<br />
<div class="outline-text-5" id="text-1-2-2-4">
<ul class="org-ul">
<li>the heights of left and right trees can have a maximum height difference of 1.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge425575" class="outline-4">
<h4 id="orge425575"><span class="section-number-4">1.2.3.</span> binary search tree</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
value of left node must be smaller than parent, and value of right node must be greater than the parent node.
</p>
</div>
<ol class="org-ol">
<li><a id="org91c63a0"></a>binary search tree insertion<br /></li>
<li><a id="org2633e29"></a>binary search tree deletion<br />
<div class="outline-text-5" id="text-1-2-3-2">
<ul class="org-ul">
<li>it works the same as a linked list operation.</li>
<li>we use in order traversal to figure out the node&rsquo;s value, it takes the value of its in order successor.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8c1b01b" class="outline-4">
<h4 id="org8c1b01b"><span class="section-number-4">1.2.4.</span> Avl Trees(Height Balanced Binary Tree)</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
what this solves is the fact that we have a series of insertions that are &rsquo;skinny&rsquo;. an avl tree is balanced, the height is as minimal as possible.
</p>

<p>
each node is given a balancing factor, \(= h_l-h_r\)
a tree is said to be imbalanced if any node is said to have a balancing factor \(\geq\) 2.
there are 4 insertions that can be performed, also known as &rsquo;rotations&rsquo;:
</p>
<ul class="org-ul">
<li>ll - /, ll rotation, involve shifting a node to the right, the central node in the line becomes a root node.</li>
<li>rr - \, rr rotation, involves shifting a node to the left, the central node in the line becomes a root node.</li>
<li>lr - &lt;, lr rotation, the last node in the subtree becomes the root node(it forms an rr + ll rotation)</li>
<li>rl - &gt;, rl rotation, the last node in the subtree becomes the root node(perform an ll + rr rotation)</li>
</ul>

<p>
the first letter is the sub-tree, and the second letter is the child node.
</p>

<p>
construct an avl tree by inserting 14,17,11,7,53,4,13,12,8,16,19,60,20
</p>

<p>
all 4 rotations are capable of causing an imbalance.
</p>
<div class="org-src-container">
<pre class="src src-nil">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcca8727" class="outline-3">
<h3 id="orgcca8727"><span class="section-number-3">1.3.</span> Heap</h3>
<div class="outline-text-3" id="text-1-3">
<p>
heap is a data structure with a complete binary tree. this tree is mainly used for creating an efficient sorting algorithm.
</p>
</div>
<div id="outline-container-org9ba886e" class="outline-4">
<h4 id="org9ba886e"><span class="section-number-4">1.3.1.</span> Types Of Heap</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
there are two types of heap:
</p>
</div>
<ol class="org-ol">
