Archive/sem-3/College Notes/DSA.tex
this involves traversing the nodes until an edge node is met, using a stack.

the procedure follows:
\begin{itemize}
\item a node is selected and pushed into the stack.
\item a random node connected to a is pushed.
\item a connected node is pushed.
\item this procedure is met until no unvisited node exists
\begin{itemize}
\item in which case the stack is full.
\item if the stack is still not full, it implies that there are nodes which haven't been visited.
\end{itemize}
\item now popping occurs
\item the algorithm goes back and checks for unvisited nodes by popping the stack and checking the topmost element's adjacent nodes for unvisited nodes.
\item this is done until the stack is empty
\end{itemize}

\begin{verbatim}
class dfs {
  dfs(int v)  {
    adj = new linkedlist[v];
    visited = new boolean[v];
    for (int i = 0; i < v; i++)
      adj[i] = new linkedlist<integer>();
  }
}
\end{verbatim}
\end{enumerate}
\subsection{trees}
\label{sec:org850041e}

a tree with at most two links from one node is known as a binary tree.
\subsubsection{properties}
\label{sec:orgfdf15ff}
\begin{itemize}
\item maximum number of nodes - \(2^i\)
\item height is longest distance between root to leaf nodes (count the edges)
\item maximum number of nodes possible till height h is \((2^0 + 2^1 + 2^2 + \cdots 2^h)\) = \(2^{h+1} -1\)
\end{itemize}
\subsubsection{types of binary trees}
\label{sec:org42e8d41}
\begin{enumerate}
\item full/proper/strict binary tree
\label{sec:orgc7d3026}
it is a tree where each node must contain 2 children except the leaf node.

\begin{itemize}
\item there are either two children or no children.
\item the number of leaf nodes is equal to number of internal nodes + 1
\item the minimum number of nodes is equal to \(2^h + 1\)
\item maximum number of nodes is the same as number of nodes in binary tree, \(2^{h+1} - 1\)
\item the minimum height of the full binary tree is \(log_2(n+1) - 1\)
\end{itemize}
\item complete binary tree
\label{sec:org9f78063}
a binary tree where all the nodes are completely filled except the last level.
\item todo degenerate binary tree
\label{sec:org1d8b769}
exactly like a linked list.
\item balanced binary tree
\label{sec:org2f9db03}
\begin{itemize}
\item the heights of left and right trees can have a maximum height difference of 1.
\end{itemize}
\end{enumerate}
\subsubsection{binary search tree}
\label{sec:org460b678}
value of left node must be smaller than parent, and value of right node must be greater than the parent node.
\begin{enumerate}
\item binary search tree insertion
\label{sec:orga3d0543}
\item binary search tree deletion
\label{sec:orgbc1beb6}
\begin{itemize}
\item it works the same as a linked list operation.
\item we use in order traversal to figure out the node's value, it takes the value of its in order successor.
\end{itemize}
\end{enumerate}
\subsubsection{avl trees(height balanced binary tree)}
\label{sec:org374941f}
what this solves is the fact that we have a series of insertions that are 'skinny'. an avl tree is balanced, the height is as minimal as possible.

each node is given a balancing factor, \(= h_l-h_r\)
a tree is said to be imbalanced if any node is said to have a balancing factor \(\geq\) 2.
there are 4 insertions that can be performed, also known as 'rotations':
\begin{itemize}
\item ll - /, ll rotation, involve shifting a node to the right, the central node in the line becomes a root node.
\item rr - $\backslash$, rr rotation, involves shifting a node to the left, the central node in the line becomes a root node.
\item lr - <, lr rotation, the last node in the subtree becomes the root node(it forms an rr + ll rotation)
\item rl - >, rl rotation, the last node in the subtree becomes the root node(perform an ll + rr rotation)
\end{itemize}

the first letter is the sub-tree, and the second letter is the child node.

construct an avl tree by inserting 14,17,11,7,53,4,13,12,8,16,19,60,20

all 4 rotations are capable of causing an imbalance.
\subsection{heap}
\label{sec:org62f0645}
heap is a data structure with a complete binary tree. this tree is mainly used for creating an efficient sorting algorithm.
\subsubsection{Types Of Heap}
\label{sec:org940d6ad}
there are two types of heap:
\begin{enumerate}
\item Min Heap
\label{sec:org0fae3cc}
the value of the root node is less than or equal to its children
\item Max Heap
\label{sec:orgcd759c4}
the value of the root node is more than or equal to its children
\end{enumerate}
