College Notes/DSA.html
<li><a id="org144e303"></a>Min Heap<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
the value of the root node is less than or equal to its children
</p>
</div>
</li>
<li><a id="org5ce7c26"></a>Max Heap<br />
<div class="outline-text-5" id="text-1-3-1-2">
<p>
the value of the root node is more than or equal to its children
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb89f4af" class="outline-4">
<h4 id="orgb89f4af"><span class="section-number-4">1.3.2.</span> Definition</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
a heap is a special form of complete binary tree where the key value is lesser than or greater than its children.
a heap is typically represented as an array, the array representation for a tree, is for each node
a parent node is represented by \(\frac{i}{2} - 1\), the left child node is \(2\times i + 1\) and the right child node is \(2 \times i + 2\)
</p>

<p>
heaps can be used for sorting, by deleting the root node until none are left, we get a sorted array.
</p>
</div>
</div>
<div id="outline-container-org4bff801" class="outline-4">
<h4 id="org4bff801"><span class="section-number-4">1.3.3.</span> Insertion</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
the process of insertion involves:
</p>
<ul class="org-ul">
<li>adding a node to the leftmost child node available.</li>
<li>comparing the node&rsquo;s value with the parent node
<ul class="org-ul">
<li>if current node&rsquo;s value is \(i\), we have \(\frac{(i-1)}{2}\)</li>
</ul></li>
<li>if the comparison yields the result that the definition of heap does not hold, then the values of the parent node and the child node are swapped.</li>
<li>repeat until the comparison holds.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #6c7086;">// </span><span style="color: #6c7086;">i is the variable holding the last position</span>
<span style="color: #6c7086;">// </span><span style="color: #6c7086;">k is the value we are trying to add to the heap.</span>
<span style="color: #f9e2af;">void</span> <span style="color: #89b4fa;">insert</span><span style="color: #f38ba8;">(</span><span style="color: #f9e2af;">a</span>,<span style="color: #f9e2af;">i</span>,<span style="color: #f9e2af;">k</span><span style="color: #f38ba8;">){</span>
i = i + <span style="color: #fab387;">1</span>;
a<span style="color: #fab387;">[</span>i<span style="color: #fab387;">]</span> = k;
<span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span>i &gt; <span style="color: #fab387;">0</span><span style="color: #fab387;">){</span>
&#9474;   <span style="color: #cba6f7;">if</span><span style="color: #f9e2af;">(</span>a<span style="color: #a6e3a1;">[</span><span style="color: #f38ba8;">(</span>i-<span style="color: #fab387;">1</span><span style="color: #f38ba8;">)</span>/<span style="color: #fab387;">2</span><span style="color: #a6e3a1;">]</span> &gt; a<span style="color: #a6e3a1;">[</span>i<span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">){</span>
&#9474;   &#9474;   t = a<span style="color: #a6e3a1;">[</span>i<span style="color: #a6e3a1;">]</span>;
&#9474;   &#9474;   a<span style="color: #a6e3a1;">[</span>i<span style="color: #a6e3a1;">]</span> = a<span style="color: #a6e3a1;">[</span><span style="color: #f38ba8;">(</span>i-<span style="color: #fab387;">1</span><span style="color: #f38ba8;">)</span>/<span style="color: #fab387;">2</span><span style="color: #a6e3a1;">]</span>;
&#9474;   &#9474;   a<span style="color: #a6e3a1;">[</span><span style="color: #f38ba8;">(</span>i-<span style="color: #fab387;">1</span><span style="color: #f38ba8;">)</span>/<span style="color: #fab387;">2</span><span style="color: #a6e3a1;">]</span> = t;
&#9474;   <span style="color: #f9e2af;">}</span>
&#9474;   <span style="color: #cba6f7;">else</span>
&#9474;       <span style="color: #cba6f7;">return</span>;
&#9474;   <span style="color: #fab387;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga8825ad" class="outline-4">
<h4 id="orga8825ad"><span class="section-number-4">1.3.4.</span> Deletion</h4>
<div class="outline-text-4" id="text-1-3-4">
<ul class="org-ul">
<li>Deletion can only happen at the root node.</li>
<li>This deletion takes place when you&rsquo;re trying to perform &rsquo;heap sort&rsquo;.</li>
</ul>

<p>
For an array, [52,24,30,12,16,5]
</p>

<p>
We have 52 as the root node.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">k</span> = a<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>;
a<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = a<span style="color: #f38ba8;">[</span>n<span style="color: #f38ba8;">]</span>;
a<span style="color: #f38ba8;">[</span>n<span style="color: #f38ba8;">]</span> = k;
n = n-<span style="color: #fab387;">1</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d89df7" class="outline-3">
<h3 id="org4d89df7"><span class="section-number-3">1.4.</span> Tries</h3>
<div class="outline-text-3" id="text-1-4">
<p>
How do you go about storing a dictionary? We construct a root node with 26 child nodes, one for each letter. Then each letter, sequentially forms the subsequent child node.
</p>

<p>
Trie is a sorted tree based data structure that stores a set of strings, it has \(n\) pointers, where \(n\) is the number of characters in the alphabet, in each node. It can search a word in the dictionary with the help of the character nodes preceding the end of the word. It searches incrementally by character.
</p>
</div>
<div id="outline-container-orge1848b2" class="outline-4">
<h4 id="orge1848b2"><span class="section-number-4">1.4.1.</span> Properties Of Trie</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>the root node of the trie is empty with \(n\) pointers, it represents the &rsquo;full&rsquo; node</li>
<li>each child node is sorted alphabetically.</li>
<li>each node can have a maximum of \(n\) children.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf79536e" class="outline-4">
<h4 id="orgf79536e"><span class="section-number-4">1.4.2.</span> Applications</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>Dictionary</li>
<li>Address Book</li>
<li>Phone Book</li>
<li>Spell checker</li>
<li>Browser history</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org70eaee6" class="outline-3">
<h3 id="org70eaee6"><span class="section-number-3">1.5.</span> Hashing</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org0428036" class="outline-4">
<h4 id="org0428036"><span class="section-number-4">1.5.1.</span> Hash Table</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Hash tables are a 2-dimensional data structure of a fixed size. They allow you to have one probe, the data can be returned immediately
</p>
</div>
</div>
<div id="outline-container-orgd0d4f58" class="outline-4">
<h4 id="orgd0d4f58"><span class="section-number-4">1.5.2.</span> Hash Functions</h4>
<div class="outline-text-4" id="text-1-5-2">
<ol class="org-ol">
<li>Division method
Given a set of data \(k\), for a one-dimensional hash table of a size \(n\), We store the elements, where \(u\) is the element in the hash and the hash function is \(h(k)\)
\(i = h_{k} \% n\)  \(u_i = k\), we find the index through the modulus function and store it in the corresponding element within the array.</li>
</ol>

<p>
QUESTION: Use division method, to store the following data into a hash table of size \(m=10\), the has function is \(h_k = (2k_i + 5)\)
</p>

<ol class="org-ol">
<li>Folding method</li>
<li>Mid-square method</li>
<li>Modulo-multiplication method</li>
</ol>
</div>
</div>
