Archive/sem-3/College Notes/DSA.tex
\subsubsection{Definition}
\label{sec:org65c9edd}
a heap is a special form of complete binary tree where the key value is lesser than or greater than its children.
a heap is typically represented as an array, the array representation for a tree, is for each node
a parent node is represented by \(\frac{i}{2} - 1\), the left child node is \(2\times i + 1\) and the right child node is \(2 \times i + 2\)

heaps can be used for sorting, by deleting the root node until none are left, we get a sorted array.
\subsubsection{Insertion}
\label{sec:org89840a4}
the process of insertion involves:
\begin{itemize}
\item adding a node to the leftmost child node available.
\item comparing the node's value with the parent node
\begin{itemize}
\item if current node's value is \(i\), we have \(\frac{(i-1)}{2}\)
\end{itemize}
\item if the comparison yields the result that the definition of heap does not hold, then the values of the parent node and the child node are swapped.
\item repeat until the comparison holds.
\end{itemize}

\begin{verbatim}
// i is the variable holding the last position
// k is the value we are trying to add to the heap.
void insert(a,i,k){
i = i + 1;
a[i] = k;
while(i > 0){
    if(a[(i-1)/2] > a[i]){
        t = a[i];
        a[i] = a[(i-1)/2];
        a[(i-1)/2] = t;
    }
    else
        return;
    }
\end{verbatim}
\subsubsection{Deletion}
\label{sec:orga785a8f}
\begin{itemize}
\item Deletion can only happen at the root node.
\item This deletion takes place when you're trying to perform 'heap sort'.
\end{itemize}

For an array, [52,24,30,12,16,5]

We have 52 as the root node.

\begin{verbatim}
int k = a[0];
a[0] = a[n];
a[n] = k;
n = n-1;
\end{verbatim}
\subsection{Tries}
\label{sec:org56c4899}
How do you go about storing a dictionary? We construct a root node with 26 child nodes, one for each letter. Then each letter, sequentially forms the subsequent child node.

Trie is a sorted tree based data structure that stores a set of strings, it has \(n\) pointers, where \(n\) is the number of characters in the alphabet, in each node. It can search a word in the dictionary with the help of the character nodes preceding the end of the word. It searches incrementally by character.
\subsubsection{Properties Of Trie}
\label{sec:org97fff9c}
\begin{itemize}
\item the root node of the trie is empty with \(n\) pointers, it represents the 'full' node
\item each child node is sorted alphabetically.
\item each node can have a maximum of \(n\) children.
\end{itemize}
\subsubsection{Applications}
\label{sec:org118f415}
\begin{itemize}
\item Dictionary
\item Address Book
\item Phone Book
\item Spell checker
\item Browser history
\end{itemize}
\subsection{Hashing}
\label{sec:orgcd9ef53}
\subsubsection{Hash Table}
\label{sec:orga49b155}
Hash tables are a 2-dimensional data structure of a fixed size. They allow you to have one probe, the data can be returned immediately
\subsubsection{Hash Functions}
\label{sec:orgfaf7567}
\begin{enumerate}
\item Division method
Given a set of data \(k\), for a one-dimensional hash table of a size \(n\), We store the elements, where \(u\) is the element in the hash and the hash function is \(h(k)\)
\(i = h_{k} \% n\)  \(u_i = k\), we find the index through the modulus function and store it in the corresponding element within the array.
\end{enumerate}

QUESTION: Use division method, to store the following data into a hash table of size \(m=10\), the has function is \(h_k = (2k_i + 5)\)

\begin{enumerate}
\item Folding method
\item Mid-square method
\item Modulo-multiplication method
\end{enumerate}
