College Notes/DSA.org
*** Collision Avoidance Methods
For open hashing, chaining method is used for collision handling
The chaining method involves creating a pointer to another node, and the conflict element is added to that node instead.

For closed hashing,
Three methods to handle collision:
1. Linear probing
   When a collision occurs, insert the hash into the subsequent node $(u+i)\%n)$.
2. Quadratic probing
   When a collision occurs, insert the hash into the node $(u+i^2)\%10)$
3. Double hashing
   We use two hashing functions

  - $h_1(k) = u$
  - $h_2(k) = v$

When there is a collision, the second hashing function is used, in every other case the first hashing function is used.

Then the new index is calculated,

$$w = (u+v*i)\%m$$

Let's take an example, we define $h_1(k) = (2k+1)\%10$, $h_2(k) = (3k+2)\%10$

|-----+---+---+---+-------|
| Key | U | V | W | Probe |
|-----+---+---+---+-------|
|   6 | 3 | - | - |     1 |
|  12 | 5 | - | - |     1 |
|  18 | 7 | - | - |     1 |
|  10 | 1 | - | - |     1 |
|   2 | 5 | - | 9 |     4 |
|  18 | - | - | - |     - |
|  22 | - | - | - |     - |
|-----+---+---+---+-------|


Now we write the hash table,
|---------+-------|
| *index* | *key* |
|---------+-------|
|       0 | -     |
|       1 | 10    |
|       2 | -     |
|       3 | 6     |
|       4 | -     |
|       5 | 12    |
|       6 | -     |
|       7 | 8     |
|       8 | -     |
|       9 | 2     |
|---------+-------|
The data array A is equal to 3,2,9,6,11,13,7,12, $n = 10$, $h_k = 2k + 3$, $h2(k) = 3k + 1$, plot the order of storage  of the data in a hash table and total probing, and average probing, with respect to chaining, linear probing, quadratic probing, double hashing
|-----+---+---+---+-------|
| Key | U | V | W | Probe |
|-----+---+---+---+-------|
|   3 | 9 | 0 |   |       |
|   2 | 7 | 7 |   |       |
|   6 | 5 | 9 |   |       |
|   9 | 1 | 8 |   |       |
|  11 | 5 | 4 |   |       |
|  13 | 9 | 0 |   |       |
|   7 | 7 | 2 |   |       |
|  12 | 7 | 7 |   |       |
#+TBLFM: $2=(2*$1 + 3)%10::$3=(3*$1 + 1)%10
** Merkel Trees
A hash tree is a data structure used for data verification and synchronization. It is a tree where each non-leaf node is a hash of its child node.
- The first layer is the list of all transacttion IDs in a block
- The data itself is not part the merkel tree, the first hashed values are the child nodes.
- These IDs are concatenated and hashed using SHA-256
- The second layer will be half the length of the first layer

