College Notes/DSA.html
<div id="outline-container-orgd4dbf23" class="outline-4">
<h4 id="orgd4dbf23"><span class="section-number-4">1.5.3.</span> Collision Avoidance Methods</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
For open hashing, chaining method is used for collision handling
The chaining method involves creating a pointer to another node, and the conflict element is added to that node instead.
</p>

<p>
For closed hashing,
Three methods to handle collision:
</p>
<ol class="org-ol">
<li>Linear probing
When a collision occurs, insert the hash into the subsequent node \((u+i)\%n)\).</li>
<li>Quadratic probing
When a collision occurs, insert the hash into the node \((u+i^2)\%10)\)</li>
<li>Double hashing
We use two hashing functions

<ul class="org-ul">
<li>\(h_1(k) = u\)</li>
<li>\(h_2(k) = v\)</li>
</ul></li>
</ol>

<p>
When there is a collision, the second hashing function is used, in every other case the first hashing function is used.
</p>

<p>
Then the new index is calculated,
</p>

<p>
\[w = (u+v*i)\%m\]
</p>

<p>
Let&rsquo;s take an example, we define \(h_1(k) = (2k+1)\%10\), \(h_2(k) = (3k+2)\%10\)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Key</th>
<th scope="col" class="org-right">U</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-right">Probe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">6</td>
<td class="org-right">3</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">5</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">7</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">5</td>
<td class="org-left">-</td>
<td class="org-left">9</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-right">-</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
</tr>

<tr>
<td class="org-right">22</td>
<td class="org-right">-</td>
<td class="org-left">-</td>
<td class="org-left">-</td>
<td class="org-right">-</td>
</tr>
</tbody>
</table>


<p>
Now we write the hash table,
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><b>index</b></th>
<th scope="col" class="org-left"><b>key</b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">10</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">6</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">12</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">8</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">2</td>
</tr>
</tbody>
</table>
<p>
The data array A is equal to 3,2,9,6,11,13,7,12, \(n = 10\), \(h_k = 2k + 3\), \(h2(k) = 3k + 1\), plot the order of storage  of the data in a hash table and total probing, and average probing, with respect to chaining, linear probing, quadratic probing, double hashing
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Key</th>
<th scope="col" class="org-right">U</th>
<th scope="col" class="org-right">V</th>
<th scope="col" class="org-left">W</th>
<th scope="col" class="org-left">Probe</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-right">9</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">9</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">1</td>
<td class="org-right">8</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-right">9</td>
<td class="org-right">0</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">7</td>
<td class="org-right">7</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org94c67a0" class="outline-3">
<h3 id="org94c67a0"><span class="section-number-3">1.6.</span> Merkel Trees</h3>
<div class="outline-text-3" id="text-1-6">
<p>
A hash tree is a data structure used for data verification and synchronization. It is a tree where each non-leaf node is a hash of its child node.
</p>
<ul class="org-ul">
<li>The first layer is the list of all transacttion IDs in a block</li>
<li>The data itself is not part the merkel tree, the first hashed values are the child nodes.</li>
<li>These IDs are concatenated and hashed using SHA-256</li>
<li>The second layer will be half the length of the first layer</li>
</ul>
</div>
