Archive/sem-3/College Notes/DSA.tex
\subsubsection{Collision Avoidance Methods}
\label{sec:org5bf62ad}
For open hashing, chaining method is used for collision handling
The chaining method involves creating a pointer to another node, and the conflict element is added to that node instead.

For closed hashing,
Three methods to handle collision:
\begin{enumerate}
\item Linear probing
When a collision occurs, insert the hash into the subsequent node \((u+i)\%n)\).
\item Quadratic probing
When a collision occurs, insert the hash into the node \((u+i^2)\%10)\)
\item Double hashing
We use two hashing functions

\begin{itemize}
\item \(h_1(k) = u\)
\item \(h_2(k) = v\)
\end{itemize}
\end{enumerate}

When there is a collision, the second hashing function is used, in every other case the first hashing function is used.

Then the new index is calculated,

$$w = (u+v*i)\%m$$

Let's take an example, we define \(h_1(k) = (2k+1)\%10\), \(h_2(k) = (3k+2)\%10\)

\begin{center}
\begin{tabular}{rrllr}
\hline
Key & U & V & W & Probe\\
\hline
6 & 3 & - & - & 1\\
12 & 5 & - & - & 1\\
18 & 7 & - & - & 1\\
10 & 1 & - & - & 1\\
2 & 5 & - & 9 & 4\\
18 & - & - & - & -\\
22 & - & - & - & -\\
\hline
\end{tabular}
\end{center}


Now we write the hash table,
\begin{center}
\begin{tabular}{rl}
\hline
\textbf{index} & \textbf{key}\\
\hline
0 & -\\
1 & 10\\
2 & -\\
3 & 6\\
4 & -\\
5 & 12\\
6 & -\\
7 & 8\\
8 & -\\
9 & 2\\
\hline
\end{tabular}
\end{center}
The data array A is equal to 3,2,9,6,11,13,7,12, \(n = 10\), \(h_k = 2k + 3\), \(h2(k) = 3k + 1\), plot the order of storage  of the data in a hash table and total probing, and average probing, with respect to chaining, linear probing, quadratic probing, double hashing
\begin{center}
\begin{tabular}{rrrll}
\hline
Key & U & V & W & Probe\\
\hline
3 & 9 & 0 &  & \\
2 & 7 & 7 &  & \\
6 & 5 & 9 &  & \\
9 & 1 & 8 &  & \\
11 & 5 & 4 &  & \\
13 & 9 & 0 &  & \\
7 & 7 & 2 &  & \\
12 & 7 & 7 &  & \\
\end{tabular}
\end{center}
\subsection{Merkel Trees}
\label{sec:org64c4d7a}
A hash tree is a data structure used for data verification and synchronization. It is a tree where each non-leaf node is a hash of its child node.
\begin{itemize}
\item The first layer is the list of all transacttion IDs in a block
\item The data itself is not part the merkel tree, the first hashed values are the child nodes.
\item These IDs are concatenated and hashed using SHA-256
\item The second layer will be half the length of the first layer
\end{itemize}
