College Notes/DSA.org
*** Usage
The hash nodes are used to check if data is corrupted. If the root node of the hashing function differs from the merkel tree generated from the data, then we have an issue.

|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Data Structure | Type/Representation | Algorithm    | Time Complexity                                     | Space Complexity |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Graphs         | Adjacency Matrix    | BFS          | O(v^2)                                              | O(v)             |
|                |                     | DFS          | O(v^2)                                              | O(v)             |
|                | Adjacency List      | BFS          | O(v+e)                                              | O(v)             |
|                |                     | DFS          | O(v+e)                                              | O(v)             |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Trees          | Binary Tree         | Insertion    | O(n)                                                | O(H)             |
|                |                     | Search       | O(n)                                                | O(H)             |
|                |                     | Deletion     | O(n)                                                | O(H)             |
|                |                     |              |                                                     |                  |
|                | Binary Search Tree  | Insertion    | O(n) - worst, O(h) - general                        | O(H)             |
|                |                     | Search       | O(n) - worst, O(log n) - general                    | O(H)             |
|                |                     | Deletion     | O(n) - worst, O(h) - general                        | O(H)             |
|                |                     |              |                                                     |                  |
|                | AVL Tree            | Insertion    | O(log n) - worst                                    | O(n)             |
|                |                     | Search       | O(log n) - worst                                    | O(n)             |
|                |                     | Deletion     | O(log n) - worst                                    | O(n)             |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Heap           |                     | Insertion    | O(h) - general, O(log n) - for complete binary tree | O(n)             |
|                |                     | Deletion     | O(h) - general, O(log n) - for complete binary tree | O(n)             |
|                |                     | Find min/max | O(1)                                                | O(n)             |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Trie           |                     | Insertion    | O(number of words * maximum length of word)         |                  |
|                |                     | Search       | O(number of words * maximum length of word)         |                  |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
| Hash Table     |                     | Insertion    | O(1) - general, worst case - O(n)                   | O(n)             |
|                |                     | Search       | O(1) - general, worst case - O(n)                   | O(n)             |
|                |                     | Deletion     | O(1) - general, worst case - O(n)                   | O(n)             |
|----------------+---------------------+--------------+-----------------------------------------------------+------------------|
