College Notes/DSA.html
<div id="outline-container-org5f1e0df" class="outline-4">
<h4 id="org5f1e0df"><span class="section-number-4">1.6.1.</span> Usage</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
The hash nodes are used to check if data is corrupted. If the root node of the hashing function differs from the merkel tree generated from the data, then we have an issue.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Data Structure</th>
<th scope="col" class="org-left">Type/Representation</th>
<th scope="col" class="org-left">Algorithm</th>
<th scope="col" class="org-left">Time Complexity</th>
<th scope="col" class="org-left">Space Complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Graphs</td>
<td class="org-left">Adjacency Matrix</td>
<td class="org-left">BFS</td>
<td class="org-left">O(v<sup>2</sup>)</td>
<td class="org-left">O(v)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">DFS</td>
<td class="org-left">O(v<sup>2</sup>)</td>
<td class="org-left">O(v)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Adjacency List</td>
<td class="org-left">BFS</td>
<td class="org-left">O(v+e)</td>
<td class="org-left">O(v)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">DFS</td>
<td class="org-left">O(v+e)</td>
<td class="org-left">O(v)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Trees</td>
<td class="org-left">Binary Tree</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(n)</td>
<td class="org-left">O(H)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Search</td>
<td class="org-left">O(n)</td>
<td class="org-left">O(H)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deletion</td>
<td class="org-left">O(n)</td>
<td class="org-left">O(H)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Binary Search Tree</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(n) - worst, O(h) - general</td>
<td class="org-left">O(H)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Search</td>
<td class="org-left">O(n) - worst, O(log n) - general</td>
<td class="org-left">O(H)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deletion</td>
<td class="org-left">O(n) - worst, O(h) - general</td>
<td class="org-left">O(H)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">AVL Tree</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(log n) - worst</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Search</td>
<td class="org-left">O(log n) - worst</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deletion</td>
<td class="org-left">O(log n) - worst</td>
<td class="org-left">O(n)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Heap</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(h) - general, O(log n) - for complete binary tree</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deletion</td>
<td class="org-left">O(h) - general, O(log n) - for complete binary tree</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Find min/max</td>
<td class="org-left">O(1)</td>
<td class="org-left">O(n)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Trie</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(number of words * maximum length of word)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Search</td>
<td class="org-left">O(number of words * maximum length of word)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Hash Table</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Insertion</td>
<td class="org-left">O(1) - general, worst case - O(n)</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Search</td>
<td class="org-left">O(1) - general, worst case - O(n)</td>
<td class="org-left">O(n)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Deletion</td>
<td class="org-left">O(1) - general, worst case - O(n)</td>
<td class="org-left">O(n)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Adithya Nair</p>
<p class="date">Created: 2024-09-30 Mon 08:40</p>
</div>
</body>
</html>
