Archive/sem-3/College Notes/DSA.tex
\subsubsection{Usage}
\label{sec:org2e91e54}
The hash nodes are used to check if data is corrupted. If the root node of the hashing function differs from the merkel tree generated from the data, then we have an issue.
\end{document}
